# GetSectionByIndex Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..GetSectionByIndex Method
MEPSystem Class See Also
---
Get the section from the index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public MEPSection GetSectionByIndex(
	int index
)
```

Visual Basic
---
```text
Public Function GetSectionByIndex ( _
	index As Integer _
) As MEPSection
```

Visual C++
---
```text
public:
MEPSection^ GetSectionByIndex(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the section in the system.
# ### Return Value
The section.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The section index is out of range. |

# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace